posts/2011-10-13-compiling-scipy-and-matplotlib-again.org
#+title: Compiling Scipy and Matplotlib again
#+date: <2011-10-13 15:27>
#+filetags: compiling python

Well, it's compile time again. Once again, I need to install scipy and matplotlib using homebrew and pip on Lion.
It seems things have improved since I tried to compile last time! Well, it still does not work out of the box, but at least now it can be done without compiling by hand:
(remember to ~brew install pkg-config gfortran~ first)

#+begin_src sh
pip install -e git+https://github.com/scipy/scipy#egg=scipy-dev
pip install -e git+https://github.com/matplotlib/matplotlib#egg=matplotlib
#+end_src

I must say, this is still a mess. But at least, it is getting less bad.
