2011-10-13-compiling-scipy-and-matplotlib-again.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Compiling Scipy and Matplotlib again</title>
<!-- 2013-11-12 Tue 16:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bastian Bechtold" />
<link rel="alternate" type="appliation/rss+xml"
                href="http://bastibe.de/rss.xml"
                title="RSS feed for bastibe.de">
          <link href='http://fonts.googleapis.com/css?family=Roboto&subset=latin' rel='stylesheet' type='text/css'>
          <link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono' rel='stylesheet' type='text/css'>
          <link href= "static/style.css" rel="stylesheet" type="text/css" />
          <title>Basti's Scratchpad on the Internet</title>
          <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
          <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
              <a href="http://bastibe.de">Basti's Scratchpad on the Internet</a>
              <div class="sitelinks">
                  <a href="http://alpha.app.net/bastibe">alpha.app.net</a>  | <a href="http://github.com/bastibe">Github</a>
              </div>
          </div>
</div>
<div id="content">
<h1 class="title">Compiling Scipy and Matplotlib again</h1>
<p>
Well, it's compile time again. Once again, I need to install scipy and matplotlib using homebrew and pip on Lion.
It seems things have improved since I tried to compile last time! Well, it still does not work out of the box, but at least now it can be done without compiling by hand:
(remember to <code>brew install pkg-config gfortran</code> first)
</p>

<div class="org-src-container">

<pre class="src src-sh">pip install -e git+https://github.com/scipy/scipy#<span style="color: #eab700;">egg</span>=scipy-dev
pip install -e git+https://github.com/matplotlib/matplotlib#<span style="color: #eab700;">egg</span>=matplotlib
</pre>
</div>

<p>
I must say, this is still a mess. But at least, it is getting less bad.
</p>
</div>
<div id="postamble" class="status">
<div id="archive"><a href="archive.html">Other posts</a></div>
              <div id="disqus_thread"></div>
              <script type="text/javascript">
              /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
              var disqus_shortname = 'bastibe';
              /* * * DON'T EDIT BELOW THIS LINE * * */
              (function() {
                var dsq = document.createElement('script');
                dsq.type = 'text/javascript';
                dsq.async = true;
                dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
                (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                  })();
              </script>
              <noscript>Please enable JavaScript to view the
                  <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
              <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</div>
</body>
</html>
